# SetUp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..SetUp Property
PipeSettings Class See Also
---
The abbreviation of the Set Up (SU) string.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string SetUp { get; set; }
```

Visual Basic
---
```text
Public Property SetUp As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SetUp {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace